# Getting started with pandas

In [1]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [2]:
%pwd

'/home/lex/Pycharm/projects/DataAnalysis/src'

### Series

In [3]:
obj = Series([4, 7, -5, 3])
print(f"{obj = }")
print(f"{obj.values = }")
print(f"{obj.index = }")

obj = 0    4
1    7
2   -5
3    3
dtype: int64
obj.values = array([ 4,  7, -5,  3])
obj.index = RangeIndex(start=0, stop=4, step=1)

In [4]:
# after operations, the relationship between indexes and values remains
obj2 = Series(
    [4, 7, -5, 3],
    index=['d', 'b', 'a', 'c']
)
print(f"{obj2 = }")
print(f"{obj.index = }")
print(f"{obj2['a'] = }")
obj2['d'] = 6
print(f"{obj2[['c', 'a', 'd']] = }")
print(f"{obj2[obj2 > 0] = }")
print(f"{obj2 * 2 = }")
print(f"{np.exp(obj2) = }")

obj2 = d    4
b    7
a   -5
c    3
dtype: int64
obj.index = RangeIndex(start=0, stop=4, step=1)
obj2['a'] = -5
obj2[['c', 'a', 'd']] = c    3
a   -5
d    6
dtype: int64
obj2[obj2 > 0] = d    6
b    7
c    3
dtype: int64
obj2 * 2 = d    12
b    14
a   -10
c     6
dtype: int64
np.exp(obj2) = d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [5]:
# pd.Series like a ordinary dict and can be created from dict
sdata = {
    'Ohio': 35000,
    'Texas': 71000,
    'Oregon': 16000,
    'Utah': 5000
}
obj3 = Series(sdata)
print(f"{obj3 = }")
print(f"{'Ohio' in obj3 = }")
print(f"{'Random' in obj3 = }")

obj3 = Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
'Ohio' in obj3 = True
'Random' in obj3 = False

In [6]:

print(f"{'California' in sdata = }")
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

'California' in sdata = False

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [7]:
print(f"{pd.isnull(obj4) = }")
print(f"{obj4.isnull() = }")
print(f"{pd.notnull(obj4) = }")
print(f"{obj4.notnull() = }")

pd.isnull(obj4) = California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
obj4.isnull() = California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
pd.notnull(obj4) = California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool
obj4.notnull() = California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [8]:
# Series can use auto-merge within math operations
print(f"{obj3 = }")
print(f"{obj4 = }")
print(f"{obj3 + obj4 = }")

obj3 = Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
obj4 = California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
obj3 + obj4 = California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [9]:
print(f"{obj4 = }")
print(f"{obj4.name = }")
obj4.name = 'population'
print(f"{obj4.name = }")
print(f"{obj4.index.name = }")
obj4.index.name = 'state'
print(f"{obj4.index.name = }")
# print(f"{obj4 = }")
obj4

obj4 = California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
obj4.name = None
obj4.name = 'population'
obj4.index.name = None
obj4.index.name = 'state'

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [10]:
# Change index instantly
print(f"{obj = }")
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

obj = 0    4
1    7
2   -5
3    3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [11]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [12]:
# Set order of columns names
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [13]:
# Empty column fill up by NaN
frame2 = DataFrame(
    data,
    columns=['year', 'state', 'pop', 'debt'],
    index=['one', 'two', 'three', 'four', 'five']
)

print(f"{frame2.columns = }")
print(f"{frame2['state'] = }")  # One column extract like Series
print(f"{frame2.year = }")  # The same result
frame2

frame2.columns = Index(['year', 'state', 'pop', 'debt'], dtype='object')
frame2['state'] = one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object
frame2.year = one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [14]:
# print(f"{frame2.ix['three'] = }")  # NB! DEPRECATED!!!
print(f"{frame2.loc['three', :] = }")

frame2.loc['three', :] = year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [15]:
# Set scalar value to whole column
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [16]:
# Set list values to column, required the same length.
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [17]:
# In Series case will used auto-merge + fill NaN for missing cells
val = Series(
    [-1.2, -1.5, -1.7],
    index=['two', 'four', 'five']
)
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [18]:
# If column not exists it will be created
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [19]:
del frame2['eastern']
frame2.columns  # NB! It is a view. Method copy() for copying.

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [20]:
# External keys - columns, internal keys - indexes
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [21]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [22]:
# If indexes explicitly set than internal dict keys will NOT merged
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [23]:
# Dict of series can turn to DataFrame
pdata = {
    'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Nevada'][:2]
}
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [24]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [25]:
print(f"{frame3.values = }")
# Different types in columns, dtype will try return some general type
print(f"{frame2.values = }")

frame3.values = array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])
frame2.values = array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [26]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
print(f"{index = }")
print(f"{index[1:] = }")

index = Index(['a', 'b', 'c'], dtype='object')
index[1:] = Index(['b', 'c'], dtype='object')

In [27]:
# NB! Index obj is immutable.
try:
    index[1] = 'd'
except TypeError as e:
    print(f"Error is {e}")

# Goal is reuse Index for another structure.
obj2 = Series([1.5, -2.5, 0], index=index)
print(f"{obj2.index is index = }")

Error is Index does not support mutable operations
obj2.index is index = True

In [28]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [29]:
# The behavior of Index similar to list
print(f"{'Ohio' in frame3.columns}")
print(f"{2003 in frame3.index}")

True
False

### Reindexing

In [30]:
obj = Series(
    [4.5, 7.2, -5.3, 3.6],
    index=['d', 'b', 'a', 'c']
)
print(f"{obj = }")
# Data will be reorganized with auto-merge + NaN on empty cells
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
print(f"{obj2 = }")

obj3 = obj.reindex(
    ['a', 'b', 'c', 'd', 'e'],
    fill_value=0
)
print(f"""{obj3 = }""")

obj = d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
obj2 = a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64
obj3 = a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [31]:
obj4 = Series(
    ['blue', 'purple', 'yellow'],
    index=[0, 2, 4]
)
obj4.reindex(range(6), method='ffill')  # also - pad

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [32]:
frame = DataFrame(
    np.arange(9).reshape((3, 3)),
    index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California']
)
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [33]:
# By default reindex for rows
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [34]:
states = ['Texas', 'Utah', 'California']
frame = frame.reindex(columns=states)
frame

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [35]:
frame = frame.reindex(
    index=['a', 'b', 'c', 'd'],
    method='ffill',
    columns=states
)
frame

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping entries from an axis

In [36]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
print(f"""{obj.drop('c') = }""")
print(f"""{obj.drop(['d', 'c']) = }""")

obj.drop('c') = a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64
obj.drop(['d', 'c']) = a    0.0
b    1.0
e    4.0
dtype: float64

In [37]:
data = DataFrame(
    np.arange(16).reshape((4, 4)),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one', 'two', 'three', 'four']
)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [38]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [40]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [41]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(f"""{obj['b'] = }""")
print(f"""{obj[1] = }""")
print(f"""{obj[['b', 'a', 'd']] = }""")
print(f"""{obj[[1, 3]] = }""")
print(f"""{obj['b':'c'] = }""")
print(f"""{obj[obj < 2] = }""")

obj['b':'c'] = 5
obj

obj['b'] = 1.0
obj[1] = 1.0
obj[['b', 'a', 'd']] = b    1.0
a    0.0
d    3.0
dtype: float64
obj[[1, 3]] = b    1.0
d    3.0
dtype: float64
obj['b':'c'] = b    1.0
c    2.0
dtype: float64
obj[obj < 2] = a    0.0
b    1.0
dtype: float64

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [42]:
data = DataFrame(
    np.arange(16).reshape((4, 4)),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one', 'two', 'three', 'four']
)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [44]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [45]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [46]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [48]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Arithmetic and data alignment

In [49]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [50]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [51]:
df1 = DataFrame(
    np.arange(9.).reshape((3, 3)),
    columns=list('bcd'),
    index=['Ohio', 'Texas', 'Colorado']
)
df2 = DataFrame(
    np.arange(12.).reshape((4, 3)),
    columns=list('bde'),
    index=['Utah', 'Ohio', 'Texas', 'Oregon']
)

In [52]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [53]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [54]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [55]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [56]:
arr[0]

array([0., 1., 2., 3.])

In [57]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [58]:
frame = DataFrame(
    np.arange(12.).reshape((4, 3)),
    columns=list('bde'),
    index=['Utah', 'Ohio', 'Texas', 'Oregon']
)
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [59]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [60]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [61]:
# Reindexing missing fields
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [62]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [63]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [64]:
frame = DataFrame(
    np.random.randn(4, 3),
    columns=list('bde'),
    index=['Utah', 'Ohio', 'Texas', 'Oregon']
)
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [65]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [66]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [67]:
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [68]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [69]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [70]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [71]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [72]:
frame = DataFrame(
    np.arange(8).reshape((2, 4)),
    index=['three', 'one'],
    columns=['d', 'a', 'b', 'c']
)
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [73]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [74]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [75]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [76]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [77]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [78]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [79]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [80]:
# TODO Need more info about ranks
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [81]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [82]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [83]:
frame = DataFrame({
    'b': [4.3, 7, -3, 2],
    'a': [0, 1, 0, 1],
    'c': [-2, 5, 8, -2.5]
})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [84]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis indexes with duplicate values

In [85]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [86]:
obj.index.is_unique

False

In [87]:
obj['a']

a    0
a    1
dtype: int64

In [88]:
obj['c']

4

In [89]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [90]:
df.loc['b']  # before it was -> df.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [91]:
df = DataFrame(
    [[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
    index=['a', 'b', 'c', 'd'],
    columns=['one', 'two']
)
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [92]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [93]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [94]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [95]:
df.idxmax()

one    b
two    d
dtype: object

In [96]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [97]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [98]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [99]:
import pandas_datareader as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

/home/lex/.local/share/virtualenvs/DataAnalysis-ytjDrxxH/lib/python3.8/site-packages/pandas_datareader/compat/__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [100]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-06-08  0.005912  0.027942  0.006197  0.005715
2020-06-09  0.031578 -0.028582  0.007645  0.006602
2020-06-10  0.025728 -0.015166  0.037092  0.006654
2020-06-11 -0.048010 -0.091322 -0.053698 -0.042303
2020-06-12  0.008634  0.033048  0.007892  0.006653

In [101]:
returns.MSFT.corr(returns.IBM)

0.595572512371279

In [102]:
returns.MSFT.cov(returns.IBM)

0.0001657631344318354

In [103]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.529370  0.713068  0.643896
IBM   0.529370  1.000000  0.595573  0.527776
MSFT  0.713068  0.595573  1.000000  0.751875
GOOG  0.643896  0.527776  0.751875  1.000000

In [104]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000332  0.000155  0.000225  0.000201
IBM   0.000155  0.000259  0.000166  0.000146
MSFT  0.000225  0.000166  0.000299  0.000223
GOOG  0.000201  0.000146  0.000223  0.000295

In [105]:
returns.corrwith(returns.IBM)

AAPL    0.529370
IBM     1.000000
MSFT    0.595573
GOOG    0.527776
dtype: float64

In [106]:
returns.corrwith(volume)

AAPL   -0.140641
IBM    -0.113600
MSFT   -0.067271
GOOG   -0.039280
dtype: float64

### Unique values, value counts, and membership

In [107]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [108]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [109]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [110]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
d    1
b    2
dtype: int64

In [111]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [112]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [113]:
data = DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]
})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [114]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [115]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [116]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [117]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [118]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [119]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [120]:
data = DataFrame([
    [1., 6.5, 3.],
    [1., NA, NA],
    [NA, NA, NA],
    [NA, 6.5, 3.]
])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [121]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [122]:
data.dropna(how='all')  # NB! for row totally filled by NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [123]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [124]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [125]:
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA; df.loc[:2, 2] = NA
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [126]:
df.dropna(thresh=2)

          0         1         2
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

### Filling in missing data

In [127]:
df.fillna(0)

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [128]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.577087  0.500000       NaN
1  0.523772  0.500000       NaN
2 -0.713544  0.500000       NaN
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [129]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [130]:
df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674       NaN  1.004812
3  1.327195       NaN -1.549106
4  0.022185       NaN       NaN
5  0.862580       NaN       NaN

In [131]:
df.fillna(method='ffill')

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185  1.349742 -1.549106
5  0.862580  1.349742 -1.549106

In [132]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185       NaN -1.549106
5  0.862580       NaN -1.549106

In [133]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [134]:
data = Series(
    np.random.randn(10),
    index=[
        ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
        [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]
    ]
)
data

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [135]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [136]:
data['b']

1   -0.023493
2   -2.304234
3   -0.652469
dtype: float64

In [137]:
data['b':'d']  # include last index

b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [138]:
data.loc[['b', 'd']]

b  1   -0.023493
   2   -2.304234
   3   -0.652469
d  2    1.074623
   3    0.723642
dtype: float64

In [139]:
data[:, 2]

a    0.852965
b   -2.304234
c   -1.332610
d    1.074623
dtype: float64

In [140]:
# NB! Series -> Frame
data.unstack()

          1         2         3
a  0.670216  0.852965 -0.955869
b -0.023493 -2.304234 -0.652469
c -1.218302 -1.332610       NaN
d       NaN  1.074623  0.723642

In [141]:
# NB! Frame -> Series
data.unstack().stack()

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [142]:
frame = DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[
        ['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']
    ]
)
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [143]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [144]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays(
    [
        ['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']
    ],
    names=['state', 'color']
)

### Reordering and sorting levels

In [145]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [146]:
frame.sort_index(1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [147]:
frame.swaplevel(0, 1).sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [148]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [149]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [150]:
frame = DataFrame({
    'a': range(7), 'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]
})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [151]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [152]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [153]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### Integer indexing

In [154]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [155]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [156]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [157]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [158]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [163]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

### Panel data

In [164]:
# TODO More info about panel
pdata = pd.Panel(
    dict(
        (stk, web.get_data_yahoo(stk))
        for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL'])
)

<ipython-input-164-ba0e2863d974>:1: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  pdata = pd.Panel(

TypeError: Panel() takes no arguments

In [ ]:
pdata

In [ ]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

In [ ]:
pdata.ix[:, '6/1/2012', :]

In [ ]:
pdata.ix['Adj Close', '5/22/2012':, :]

In [ ]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

In [ ]:
stacked.to_panel()